FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf53_erratas.h
/* ========= Errata 1 ========= */
#if    defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
    #if defined( NRF_APPLICATION )
        #define NRF53_ERRATA_1_PRESENT    1
    #else
        #define NRF53_ERRATA_1_PRESENT    0
    #endif
#else
    #define NRF53_ERRATA_1_PRESENT        0
#endif

#ifndef NRF53_ERRATA_1_ENABLE_WORKAROUND
    #define NRF53_ERRATA_1_ENABLE_WORKAROUND    NRF53_ERRATA_1_PRESENT
#endif

static bool nrf53_errata_1( void )
{
    #ifndef NRF53_SERIES
        return false;
    #else
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_APPLICATION )
                #if defined( NRF_TRUSTZONE_NONSECURE )
                    uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                    uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
                #else
                    uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                    uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
                #endif
            #endif
        #endif
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_APPLICATION )
                if( var1 == 0x07 )
                {
                    switch( var2 )
                    {
                        case 0x02ul:
                            return true;

                        case 0x03ul:
                            return false;

                        case 0x04ul:
                            return false;

                        case 0x05ul:
                            return false;

                        default:
                            return false;
                    }
                }
            #endif /* if defined( NRF_APPLICATION ) */
        #endif /* if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 ) */
        return false;
    #endif /* ifndef NRF53_SERIES */
}

/* ========= Errata 2 ========= */
#if    defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
    #if defined( NRF_APPLICATION )
        #define NRF53_ERRATA_2_PRESENT    1
    #else
        #define NRF53_ERRATA_2_PRESENT    0
    #endif
#else
    #define NRF53_ERRATA_2_PRESENT        0
#endif

#ifndef NRF53_ERRATA_2_ENABLE_WORKAROUND
    #define NRF53_ERRATA_2_ENABLE_WORKAROUND    NRF53_ERRATA_2_PRESENT
#endif

static bool nrf53_errata_2( void )
{
    #ifndef NRF53_SERIES
        return false;
    #else
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_APPLICATION )
                #if defined( NRF_TRUSTZONE_NONSECURE )
                    uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                    uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
                #else
                    uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                    uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
                #endif
            #endif
        #endif
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_APPLICATION )
                if( var1 == 0x07 )
                {
                    switch( var2 )
                    {
                        case 0x02ul:
                            return true;

                        case 0x03ul:
                            return false;

                        case 0x04ul:
                            return false;

                        case 0x05ul:
                            return false;

                        default:
                            return false;
                    }
                }
            #endif /* if defined( NRF_APPLICATION ) */
        #endif /* if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 ) */
        return false;
    #endif /* ifndef NRF53_SERIES */
}

/* ========= Errata 3 ========= */
#if    defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
    #if defined( NRF_APPLICATION )
        #define NRF53_ERRATA_3_PRESENT    1
    #else
        #define NRF53_ERRATA_3_PRESENT    0
    #endif
#else
    #define NRF53_ERRATA_3_PRESENT        0
#endif

#ifndef NRF53_ERRATA_3_ENABLE_WORKAROUND
    #define NRF53_ERRATA_3_ENABLE_WORKAROUND    NRF53_ERRATA_3_PRESENT
#endif

static bool nrf53_errata_3( void )
{
    #ifndef NRF53_SERIES
        return false;
    #else
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_APPLICATION )
                #if defined( NRF_TRUSTZONE_NONSECURE )
                    uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                    uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
                #else
                    uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                    uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
                #endif
            #endif
        #endif
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_APPLICATION )
                if( var1 == 0x07 )
                {
                    switch( var2 )
                    {
                        case 0x02ul:
                            return true;

                        case 0x03ul:
                            return false;

                        case 0x04ul:
                            return false;

                        case 0x05ul:
                            return false;

                        default:
                            return false;
                    }
                }
            #endif /* if defined( NRF_APPLICATION ) */
        #endif /* if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 ) */
        return false;
    #endif /* ifndef NRF53_SERIES */
}

/* ========= Errata 4 ========= */
#if    defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
    #if defined( NRF_APPLICATION )
        #define NRF53_ERRATA_4_PRESENT    1
    #else
        #define NRF53_ERRATA_4_PRESENT    0
    #endif
#else
    #define NRF53_ERRATA_4_PRESENT        0
#endif

