FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf53_erratas.h
                        case 0x03ul:
                            return false;

                        case 0x04ul:
                            return false;

                        case 0x05ul:
                            return false;

                        default:
                            return false;
                    }
                }
            #endif /* if defined( NRF_APPLICATION ) */
        #endif /* if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 ) */
        return false;
    #endif /* ifndef NRF53_SERIES */
}

/* ========= Errata 19 ========= */
#if    defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
    #if defined( NRF_APPLICATION )
        #define NRF53_ERRATA_19_PRESENT    1
    #else
        #define NRF53_ERRATA_19_PRESENT    0
    #endif
#else
    #define NRF53_ERRATA_19_PRESENT        0
#endif

#ifndef NRF53_ERRATA_19_ENABLE_WORKAROUND
    #define NRF53_ERRATA_19_ENABLE_WORKAROUND    NRF53_ERRATA_19_PRESENT
#endif

static bool nrf53_errata_19( void )
{
    #ifndef NRF53_SERIES
        return false;
    #else
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_APPLICATION )
                #if defined( NRF_TRUSTZONE_NONSECURE )
                    uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                    uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
                #else
                    uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                    uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
                #endif
            #endif
        #endif
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_APPLICATION )
                if( var1 == 0x07 )
                {
                    switch( var2 )
                    {
                        case 0x02ul:
                            return true;

                        case 0x03ul:
                            return false;

                        case 0x04ul:
                            return false;

                        case 0x05ul:
                            return false;

                        default:
                            return false;
                    }
                }
            #endif /* if defined( NRF_APPLICATION ) */
        #endif /* if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 ) */
        return false;
    #endif /* ifndef NRF53_SERIES */
}

/* ========= Errata 20 ========= */
#if    defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
    #if defined( NRF_APPLICATION ) || \
    defined( NRF_NETWORK )
        #define NRF53_ERRATA_20_PRESENT    1
    #else
        #define NRF53_ERRATA_20_PRESENT    0
    #endif
#else
    #define NRF53_ERRATA_20_PRESENT        0
#endif

#ifndef NRF53_ERRATA_20_ENABLE_WORKAROUND
    #define NRF53_ERRATA_20_ENABLE_WORKAROUND    NRF53_ERRATA_20_PRESENT
#endif

static bool nrf53_errata_20( void )
{
    #ifndef NRF53_SERIES
        return false;
    #else
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_APPLICATION )
                #if defined( NRF_TRUSTZONE_NONSECURE )
                    uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                    uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
                #else
                    uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                    uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
                #endif
            #elif defined( NRF_NETWORK )
                uint32_t var1 = *( uint32_t * ) 0x01FF0130ul;
                uint32_t var2 = *( uint32_t * ) 0x01FF0134ul;
            #endif /* if defined( NRF_APPLICATION ) */
        #endif /* if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 ) */
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_APPLICATION ) \
            || defined( NRF_NETWORK )

                if( var1 == 0x07 )
                {
                    switch( var2 )
                    {
                        case 0x02ul:
                            return true;

                        case 0x03ul:
                            return false;

                        case 0x04ul:
                            return false;

                        case 0x05ul:
                            return false;

                        default:
                            return false;
                    }
                }
            #endif /* if defined( NRF_APPLICATION ) || defined( NRF_NETWORK ) */
        #endif /* if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 ) */
        return false;
    #endif /* ifndef NRF53_SERIES */
}

/* ========= Errata 21 ========= */
#if    defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
    #if defined( NRF_APPLICATION ) || \
    defined( NRF_NETWORK )
        #define NRF53_ERRATA_21_PRESENT    1
    #else
        #define NRF53_ERRATA_21_PRESENT    0
    #endif
#else
    #define NRF53_ERRATA_21_PRESENT        0
#endif

#ifndef NRF53_ERRATA_21_ENABLE_WORKAROUND
    #define NRF53_ERRATA_21_ENABLE_WORKAROUND    NRF53_ERRATA_21_PRESENT
#endif

static bool nrf53_errata_21( void )
{
    #ifndef NRF53_SERIES
        return false;
    #else
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_APPLICATION )
                #if defined( NRF_TRUSTZONE_NONSECURE )
                    uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                    uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
                #else
                    uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                    uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
                #endif
            #elif defined( NRF_NETWORK )
                uint32_t var1 = *( uint32_t * ) 0x01FF0130ul;
                uint32_t var2 = *( uint32_t * ) 0x01FF0134ul;
            #endif /* if defined( NRF_APPLICATION ) */
        #endif /* if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 ) */
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_APPLICATION ) \
            || defined( NRF_NETWORK )

                if( var1 == 0x07 )
                {
                    switch( var2 )
                    {
                        case 0x02ul:
                            return true;

