FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf53_erratas.h
                        case 0x03ul:
                            return true;

                        case 0x04ul:
                            return false;

                        case 0x05ul:
                            return false;

                        default:
                            return false;
                    }
                }
            #endif /* if defined( NRF_APPLICATION ) || defined( NRF_NETWORK ) */
        #endif /* if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 ) */
        return false;
    #endif /* ifndef NRF53_SERIES */
}

/* ========= Errata 22 ========= */
#if    defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
    #if defined( NRF_APPLICATION )
        #define NRF53_ERRATA_22_PRESENT    1
    #else
        #define NRF53_ERRATA_22_PRESENT    0
    #endif
#else
    #define NRF53_ERRATA_22_PRESENT        0
#endif

#ifndef NRF53_ERRATA_22_ENABLE_WORKAROUND
    #define NRF53_ERRATA_22_ENABLE_WORKAROUND    NRF53_ERRATA_22_PRESENT
#endif

static bool nrf53_errata_22( void )
{
    #ifndef NRF53_SERIES
        return false;
    #else
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_APPLICATION )
                #if defined( NRF_TRUSTZONE_NONSECURE )
                    uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                    uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
                #else
                    uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                    uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
                #endif
            #endif
        #endif
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_APPLICATION )
                if( var1 == 0x07 )
                {
                    switch( var2 )
                    {
                        case 0x02ul:
                            return true;

                        case 0x03ul:
                            return false;

                        case 0x04ul:
                            return false;

                        case 0x05ul:
                            return false;

                        default:
                            return false;
                    }
                }
            #endif /* if defined( NRF_APPLICATION ) */
        #endif /* if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 ) */
        return false;
    #endif /* ifndef NRF53_SERIES */
}

/* ========= Errata 23 ========= */
#if    defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
    #if defined( NRF_APPLICATION )
        #define NRF53_ERRATA_23_PRESENT    1
    #else
        #define NRF53_ERRATA_23_PRESENT    0
    #endif
#else
    #define NRF53_ERRATA_23_PRESENT        0
#endif

#ifndef NRF53_ERRATA_23_ENABLE_WORKAROUND
    #define NRF53_ERRATA_23_ENABLE_WORKAROUND    NRF53_ERRATA_23_PRESENT
#endif

static bool nrf53_errata_23( void )
{
    #ifndef NRF53_SERIES
        return false;
    #else
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_APPLICATION )
                #if defined( NRF_TRUSTZONE_NONSECURE )
                    uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                    uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
                #else
                    uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                    uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
                #endif
            #endif
        #endif
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_APPLICATION )
                if( var1 == 0x07 )
                {
                    switch( var2 )
                    {
                        case 0x02ul:
                            return true;

                        case 0x03ul:
                            return false;

                        case 0x04ul:
                            return false;

                        case 0x05ul:
                            return false;

                        default:
                            return false;
                    }
                }
            #endif /* if defined( NRF_APPLICATION ) */
        #endif /* if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 ) */
        return false;
    #endif /* ifndef NRF53_SERIES */
}

/* ========= Errata 26 ========= */
#if    defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
    #if defined( NRF_APPLICATION ) || \
    defined( NRF_NETWORK )
        #define NRF53_ERRATA_26_PRESENT    1
    #else
        #define NRF53_ERRATA_26_PRESENT    0
    #endif
#else
    #define NRF53_ERRATA_26_PRESENT        0
#endif

#ifndef NRF53_ERRATA_26_ENABLE_WORKAROUND
    #define NRF53_ERRATA_26_ENABLE_WORKAROUND    NRF53_ERRATA_26_PRESENT
#endif

static bool nrf53_errata_26( void )
{
    #ifndef NRF53_SERIES
        return false;
    #else
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_APPLICATION )
                #if defined( NRF_TRUSTZONE_NONSECURE )
                    uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000130ul ) );
                    uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_NS + 0x00000134ul ) );
                #else
                    uint32_t var1 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000130ul ) );
                    uint32_t var2 = *( ( volatile uint32_t * ) ( ( uint32_t ) NRF_FICR_S + 0x00000134ul ) );
                #endif
            #elif defined( NRF_NETWORK )
                uint32_t var1 = *( uint32_t * ) 0x01FF0130ul;
                uint32_t var2 = *( uint32_t * ) 0x01FF0134ul;
            #endif /* if defined( NRF_APPLICATION ) */
        #endif /* if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 ) */
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_APPLICATION ) \
            || defined( NRF_NETWORK )

                if( var1 == 0x07 )
                {
                    switch( var2 )
                    {
                        case 0x02ul:
                            return true;

