FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf53_erratas.h
                        case 0x03ul:
                            return true;

                        case 0x04ul:
                            return true;

                        case 0x05ul:
                            return true;

                        default:
                            return true;
                    }
                }
            #endif /* if defined( NRF_APPLICATION ) */
        #endif /* if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 ) */
        return false;
    #endif /* ifndef NRF53_SERIES */
}

/* ========= Errata 122 ========= */
#if    defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
    #if defined( NRF_NETWORK )
        #define NRF53_ERRATA_122_PRESENT    1
    #else
        #define NRF53_ERRATA_122_PRESENT    0
    #endif
#else
    #define NRF53_ERRATA_122_PRESENT        0
#endif

#ifndef NRF53_ERRATA_122_ENABLE_WORKAROUND
    #define NRF53_ERRATA_122_ENABLE_WORKAROUND    NRF53_ERRATA_122_PRESENT
#endif

static bool nrf53_errata_122( void )
{
    #ifndef NRF53_SERIES
        return false;
    #else
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_NETWORK )
                uint32_t var1 = *( uint32_t * ) 0x01FF0130ul;
                uint32_t var2 = *( uint32_t * ) 0x01FF0134ul;
            #endif
        #endif
        #if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 )
            #if defined( NRF_NETWORK )
                if( var1 == 0x07 )
                {
                    switch( var2 )
                    {
                        case 0x02ul:
                            return false;

                        case 0x03ul:
                            return false;

                        case 0x04ul:
                            return true;

                        case 0x05ul:
                            return true;

                        default:
                            return true;
                    }
                }
            #endif /* if defined( NRF_NETWORK ) */
        #endif /* if defined( NRF5340_XXAA ) || defined( DEVELOP_IN_NRF5340 ) */
        return false;
    #endif /* ifndef NRF53_SERIES */
}

/* ========= Errata 134 ========= */
#define NRF53_ERRATA_134_PRESENT                  0

#ifndef NRF53_ERRATA_134_ENABLE_WORKAROUND
    #define NRF53_ERRATA_134_ENABLE_WORKAROUND    NRF53_ERRATA_134_PRESENT
#endif

static bool nrf53_errata_134( void )
{
    #ifndef NRF53_SERIES
        return false;
    #else
        return false;
    #endif
}

/* ========= Errata 138 ========= */
#define NRF53_ERRATA_138_PRESENT                  0

#ifndef NRF53_ERRATA_138_ENABLE_WORKAROUND
    #define NRF53_ERRATA_138_ENABLE_WORKAROUND    NRF53_ERRATA_138_PRESENT
#endif

static bool nrf53_errata_138( void )
{
    #ifndef NRF53_SERIES
        return false;
    #else
        return false;
    #endif
}

#endif /* NRF53_ERRATAS_H */
